ka2_2024/src/Catalogs/КлассификаторУслугНаселению/КлассификаторУслугНаселению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторУслугНаселению</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/Enums/ВидыСвободныхСтрокФормСтатистики/ВидыСвободныхСтрокФормСтатистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСвободныхСтрокФормСтатистики</name>
  <enumValues>
    <name>ВидыДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииОпт</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукцииРозница</name>
  </enumValues>
  <enumValues>
    <name>УслугиНаселению</name>
  </enumValues>
  <enumValues>
    <name>ВидыДеятельностиИП</name>
  </enumValues>
  <enumValues>
    <name>ВидыУслугРозница</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/КлассификаторУслугНаселению/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ДополнительныеПараметры.Вставить("Наименование", ТекДанные.Наименование);
		ДополнительныеПараметры.Вставить("Код", ТекДанные.Код);
		ДополнительныеПараметры.Вставить("НаименованиеПолное", ТекДанные.НаименованиеПолное);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru='Есть возможность подобрать услуги из классификатора (ОКУН).
		|Подобрать?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Назначение", ПредопределенноеЗначение("Перечисление.ВидыСвободныхСтрокФормСтатистики.УслугиНаселению")); 
	ПараметрыФормы.Вставить("Подбор", Истина); 
		
	ОткрытьФорму("ОбщаяФорма.ДобавлениеЭлементовВКлассификаторСтатотчетность", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Назначение", ПредопределенноеЗначение("Перечисление.ВидыСвободныхСтрокФормСтатистики.УслугиНаселению")); 
		ПараметрыФормы.Вставить("Подбор", Истина); 
		
		ОткрытьФорму("ОбщаяФорма.ДобавлениеЭлементовВКлассификаторСтатотчетность", ПараметрыФормы, ЭтаФорма);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДополнительныеПараметры);
		ОткрытьФорму("Справочник.КлассификаторУслугНаселению.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
